area_data = {
    '台北市': [
        '中正區', '大同區', '中山區', '萬華區', '信義區', '松山區', '大安區', '南港區', '北投區', '內湖區', '士林區', '文山區'
    ],
    '新北市': [
        '板橋區', '新莊區', '泰山區', '林口區', '淡水區',   '萬里區',  '三芝區', '瑞芳區', '汐止區',  '新店區', '中和區', '永和區', '土城區', '三峽區', '樹林區', '鶯歌區', '三重區', '蘆洲區'
    ],
    '基隆市': [
        '仁愛區', '中正區', '信義區', '中山區', '安樂區', '暖暖區', '七堵區'
    ],
    '桃園市': [
        '桃園區', '中壢區', '蘆竹區', '龜山區', '八德區', '龍潭區', '平鎮區', '大溪區', '楊梅區', '大園區', '復興區', '桃園市', '新屋區', '觀音區'
    ],
    '新竹縣': [
        '竹北市', '竹東鎮', '新埔鎮', '關西鎮', '峨眉鄉', '寶山鄉', '北埔鄉', '橫山鄉', '芎林鄉', '湖口鄉', '新豐鄉', '尖石鄉', '五峰鄉'
    ],
    '新竹市': [
        '東區', '北區', '香山區'
    ],
    '苗栗縣': [
        '苗栗市', '頭份市', '竹南鎮', '頭份鎮', '三義鄉', '公館鄉', '後龍鎮', '苑裡鎮', '南庄鎮', '銅鑼鄉', '大湖鄉'
    ],
    '台中市': [
        '中區', '東區', '南區', '西區', '北區', '北屯區', '西屯區', '南屯區', '太平區', '大里區', '霧峰區',  '豐原區', '后里區', '潭子區', '大雅區',  '龍井區', '沙鹿區',  '清水區', '大甲區',
    ],
    '南投縣': [
        '埔里鎮', '草屯鎮', '南投市', '魚池鄉', '竹山鎮', '鹿谷鄉', '仁愛鄉', '水里鄉', '集集鎮'
    ],
    '彰化縣': [
        '彰化市', '員林市', '員林鎮', '鹿港鎮', '北斗鎮', '和美鎮', '溪湖鎮', '花壇鄉', '田中鎮', '埔心鄉'
    ],
    '雲林縣': [
        '斗六市', '虎尾鎮', '北港鎮', '西螺鎮', '古坑鄉'
    ],
    '嘉義縣': [
        '民雄鄉', '朴子市', '中埔鄉', '竹崎鄉', '新港鄉'
    ],
    '嘉義市': [
        '東區', '西區'
    ],
    '台南市': [
        '中西區', '東區', '北區', '永康區', '安平區', '南區', '安南區', '善化區', '新營區', '新市區', '仁德區', '歸仁區', '佳里區', '新化區', '麻豆區', '白河區', '玉井區', '鹽水區', '東山區',
    ],
    '高雄市': [
        '三民區', '左營區', '芩雅區', '新興區', '鼓山區', '鳳山區', '前鎮區', '前金區', '鹽埕區', '楠梓區', '小港區', '岡山區', '旗山區', '仁武區', '大樹區', '烏松區', '大社區', '大寮區', '旗津區'
    ],
    '屏東縣': [
        '屏東市', '恆春鎮', '潮州鎮', '東港鎮', '琉球鄉', '內埔鄉', '萬丹鄉', '長治鄉', '里港鄉', '萬巒鄉', '枋山鄉', '車城鄉', '霧台鄉'
    ],
    '宜蘭縣': [
        '宜蘭市', '羅東鎮', '礁溪鄉', '蘇澳鎮', '冬山鄉', '頭城鎮', '五結鄉', '員山鄉', '莊園鄉', '三星鄉'
    ],
    '花蓮縣': [
        '花蓮市', '吉安鄉', '壽豐鄉', '鳳林鎮', '玉里鎮', '瑞穗鄉', '光復鄉', '秀林鄉'
    ],
    '台東縣': [
        '台東市', '池上鄉', '東河鄉', '鹿野鄉', '卑南鄉', '蘭嶼鄉', '關山鎮'
    ],
    '澎湖縣': [
        '馬公市'
    ],
    '金門縣': [
        '金城鎮', '金湖鎮', '金沙鎮', '金寧鄉', '烈嶼鄉',
    ],
    '連江縣': [
        '北竿鄉', '莒光鄉', '東引鄉'
    ]
}
